test_playbook/expects/book_3_block_nested.mmd
stateDiagram-v2
    state "Play: Test 3 nested block" as play_1 {
        state "Begin<hr>action: file" as task_1
        block_1 : Block Name
        state block_1 {
            state "Second<hr>action: debug" as task_2
            block_2 : Nested block
            state block_2 {
                state "Thrid<hr>action: debug" as task_3
            }
        }
        state "End<hr>action: debug" as task_4
    }
    [*] --> task_1
    task_1 --> task_2
    task_2 --> task_3
    task_3 --> task_4
    task_4 --> [*]
