test_playbook/expects/book_3_block_nested.puml
@startuml
state "= Play: Test 3 nested block" as play_1 {
    play_1 : | hosts | localhost |
    state "== Begin" as task_1
    task_1 : Action **file**
    task_1 : | path | /path/to/dir |
    task_1 : | state | directory |
    state "Block: Block Name" as block_1 {
        state "== Second" as task_2
        task_2 : Action **debug**
        task_2 : | msg | Second Task |
        state "Block: Nested block" as block_2 {
            state "== Thrid" as task_3
            task_3 : Action **debug**
            task_3 : | msg | Third Task |
        }
    }
    state "== End" as task_4
    task_4 : Action **debug**
    task_4 : | msg | End |
}
[*] --> task_1
task_1 --> task_2
task_2 --> task_3
task_3 --> task_4
task_4 --> [*]
@enduml
